app/views/ideas/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
            <div class="card-footer text-muted">
            Posted on <%= idea.created_at.strftime("%B %-d, %Y") %> by <b>@<%= User.find_by(id: idea.user_id).username %></b>