app/views/ideas/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
        <p class="text-muted">Posted on <%= @idea.created_at.strftime('%B %-d, %Y at %l:%M %P') %></p>
        <p class="lead">by @<b><%= User.find_by(id: @idea.user_id).username %></b></p>