app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."created_at" BETWEEN $1 AND $2 ORDER BY "ideas"."created_at" DESC  [["created_at", "2020-08-13 23:37:22.399506"], ["created_at", "2020-08-14 23:37:22.399506"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = $1 ORDER BY "ideas"."created_at" DESC  [["user_id", 14]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."created_at" BETWEEN $1 AND $2 LIMIT $3 OFFSET $4  [["created_at", "2020-08-12 05:00:00"], ["created_at", "2020-08-13 05:00:00"], ["LIMIT", 5], ["OFFSET", 0]]
---
    def index

        @index_view = params.fetch(:view, 'home')
        @page = params.fetch(:page, 0).to_i

        if @index_view == 'latest'

            query = Idea.where(created_at: (Time.now.midnight - 1.day)..Time.now.midnight)
            title = 'Latest Ideas'

        elsif @index_view == 'user'

            @user = User.find_by(id: session[:user_id])
            query = @user.ideas.order(created_at: :desc)
            title = 'My Ideas'

        else

            query = Idea.order(created_at: :desc)
            title = 'Ideas Home'

        end

        @max_page = @page == (query.length / PER_PAGE).to_i
        @ideas = query.offset(@page * PER_PAGE).take(PER_PAGE)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "ideas" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "ideas" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "glass of water?"], ["content", "how to identify a glass of water"], ["user_id", 14], ["created_at", "2020-08-14 03:10:31.007797"], ["updated_at", "2020-08-14 03:10:31.007797"]]
UPDATE "ideas" SET "content" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["content", "quiero modificar esta idea"], ["updated_at", "2020-08-12 00:44:48.937370"], ["id", 3]]
---
    def create

        @user = User.find_by(id: session[:user_id])
        @idea = @user.ideas.create(idea_params)

        if @idea.save

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def show

        @idea = Idea.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def edit

        @idea = Idea.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "ideas" SET "content" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["content", "hello this is an idea modified"], ["updated_at", "2020-08-13 23:29:57.931018"], ["id", 8]]
---
    def update

        @idea = Idea.find(params[:id])

        if @idea.update(idea_params)

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 6]]
---
    def destroy

        @idea = Idea.find(params[:id])

        if @idea.user_id != session[:user_id]

            redirect_to @idea, alert: 'You don\'t have permission to modify this idea.'

        else

            @idea.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = $1 ORDER BY "ideas"."created_at" DESC  [["user_id", 14]]
---
    def user_ideas

        @user = User.find_by(id: session[:user_id])
        @ideas = @user.ideas.order(created_at: :desc).all

SELECT "ideas".* FROM "ideas" WHERE ( title LIKE '%second%')
SELECT "ideas".* FROM "ideas" WHERE ( title LIKE '%idea%')
SELECT "ideas".* FROM "ideas" WHERE ( title LIKE '%idea%') LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 5]]
---
    def search

        result_alert = nil
        @page = params.fetch(:page, 0).to_i
        @search = params[:search]

        if @search.blank?

            result_alert = 'Empty search, try again.'

        else

            search_ = @search.downcase.split
            query = Idea.where(" title LIKE '%#{search_.join('%')}%'")

        end

        @max_page = @page == (query.length / PER_PAGE).to_i
        @ideas = query.offset(@page * PER_PAGE).take(PER_PAGE)