app/controllers/ideas_controller.rb

    def create

        @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def destroy

        @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE ( title LIKE '%second%' )