app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["content", "hello this is an idea"], ["user_id", 14], ["created_at", "2020-08-12 23:07:27.471733"], ["updated_at", "2020-08-12 23:07:27.471733"]]
INSERT INTO "ideas" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "juanita first idea"], ["content", "this is the first idea of juanita"], ["user_id", 13], ["created_at", "2020-08-10 23:41:06.249412"], ["updated_at", "2020-08-10 23:41:06.249412"]]
---
    def create

        @user = User.find_by(id: session[:user_id])
        @idea = @user.ideas.create(idea_params)

        if @idea.save

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show

        @idea = Idea.find(params[:id])

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def edit

        @idea = Idea.find(params[:id])

DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 5]]
---
    def destroy

        @idea = Idea.find(params[:id])

        if @idea.user_id != session[:user_id]

            redirect_to @idea, alert: 'You don\'t have permission to modify this idea.'

        else

            @idea.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = $1 ORDER BY "ideas"."created_at" DESC LIMIT $2  [["user_id", 14], ["LIMIT", 11]]
---
    def user_ideas

        @user = User.find_by(id: session[:user_id])
        page_title = @user.username + ' Ideas'
        @ideas = @user.ideas.order(created_at: :desc).all