app/controllers/passwords_controller.rb

    def create

        @user = User.find_by(email: params[:reset_password][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "juansimon.gr@gmail.com"], ["LIMIT", 1]]

    def edit

        @user = User.find_by(reset_password_token: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "86817c005abf55018b86"], ["LIMIT", 1]]

    def update

        @user = User.find_by(reset_password_token: params[:id])

        if @user.update_attributes(password_params)

            @user.update_attribute(:reset_password_token, nil)
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "ebca8f9a3f8ccae15709"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$MbrVVij3oRn2urYvb5T1vOv4S0W2jztnZtXUg3mwDj/INVB5YpIcS"], ["updated_at", "2020-08-14 07:35:02.871615"], ["id", 1]]
UPDATE "users" SET "updated_at" = $1, "reset_password_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-08-14 07:35:02.876616"], ["reset_password_token", nil], ["id", 1]]